In [2]:
import numpy as np
import pandas as pd
df= pd.read_csv("Total.csv",low_memory=False)
df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,Not Provided,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,Not Provided,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,Not Provided,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,Not Provided,326373.19,326373.19,2011

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  object
 3   OvertimePay       312882 non-null  object
 4   OtherPay          312882 non-null  object
 5   Benefits          312882 non-null  object
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 21.5+ MB

In [4]:
df['EmployeeName'] = df['EmployeeName'].str.lower()
df['JobTitle'] = df['JobTitle'].str.lower()
df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.00,400184.25,Not Provided,567595.43,567595.43,2011
1,gary jimenez,captain iii (police department),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,albert pardini,captain iii (police department),212739.13,106088.18,16452.60,Not Provided,335279.91,335279.91,2011
3,christopher chong,wire rope cable maintenance mechanic,77916.00,56120.71,198306.90,Not Provided,332343.61,332343.61,2011
4,patrick gardner,"deputy chief of department,(fire department)",134401.60,9737.00,182234.59,Not Provided,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
312877,daniel w plautz,public service trainee,0.00,0.00,0.00,0.00,0.00,0.00,2018
312878,david j thompson,deputy sheriff,0.00,0.00,0.00,0.00,0.00,0.00,2018
312879,keiko weng yee lau,public service trainee,0.00,0.00,0.00,0.00,0.00,0.00,2018
312880,david wong,deputy sheriff,0.00,0.00,0.00,0.00,0.00,0.00,2018
312881,debora e howard,recreation leader,0.00,0.00,0.00,0.00,0.00,0.00,2018

In [5]:
df["BasePay"]=pd.to_numeric(df["BasePay"],errors= "coerce")
df["OvertimePay"]=pd.to_numeric(df["OvertimePay"],errors= "coerce")
df["OtherPay"]=pd.to_numeric(df["OtherPay"],errors= "coerce")
df["Benefits"]=pd.to_numeric(df["Benefits"],errors= "coerce")

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312276 non-null  float64
 3   OvertimePay       312881 non-null  float64
 4   OtherPay          312881 non-null  float64
 5   Benefits          276722 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

In [7]:
df.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay               606
OvertimePay             1
OtherPay                1
Benefits            36160
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [8]:
df["BasePay"]= df["BasePay"].fillna(0)
df["OvertimePay"]= df["OvertimePay"].fillna(0)
df["OtherPay"]= df["OtherPay"].fillna(0)
df["Benefits"]= df["Benefits"].fillna(0)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  float64
 3   OvertimePay       312882 non-null  float64
 4   OtherPay          312882 non-null  float64
 5   Benefits          312882 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

In [10]:
df.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

### Questions

#### 1. Basic Information:
1-How many records (rows) and fields (columns) are there in the dataset?
2-What are the names of the columns in the dataset?
3-What are the data types of each column?

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  float64
 3   OvertimePay       312882 non-null  float64
 4   OtherPay          312882 non-null  float64
 5   Benefits          312882 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

In [12]:
df.dtypes

EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

#### 2. Salary Overview:
What is the average salary for the entire dataset?
What is the highest and lowest salary recorded in the dataset?
What is the distribution of salaries across different pay scales?

In [13]:
df["TotalPay"].mean()

78802.64578777303

In [14]:
df["TotalPay"].max()

592394.34

In [15]:
df["TotalPay"].min()

-618.13

In [16]:
df["TotalPay"].describe()

count    312882.000000
mean      78802.645788
std       53230.758542
min        -618.130000
25%       38803.000000
50%       74908.790000
75%      111386.897500
max      592394.340000
Name: TotalPay, dtype: float64

#### 3. Yearly Trends:
How does the average salary change from year to year?
What is the overall salary trend over the years?

In [18]:
df.groupby('Year').mean()['TotalPay']

C:\Users\Akram\AppData\Local\Temp\ipykernel_10652\1614167822.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Year').mean()['TotalPay']

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75471.836912
2015    77508.269562
2016    80513.166356
2017    84234.645789
2018    87181.908324
Name: TotalPay, dtype: float64

#### 4.JobTitle Analysis:
1- Which Job Title  have the highest and lowest average salaries?
2- How does the salary distribution vary across different JobTitle?

In [19]:
Filter_JobTitle = df["TotalPay"] == df["TotalPay"].max()
df[Filter_JobTitle][["JobTitle", "TotalPay"]]

                JobTitle   TotalPay
270573  police officer 3  592394.34

In [20]:
Filter_JobTitlemini = df["TotalPay"] == df["TotalPay"].min()
df[Filter_JobTitlemini][["JobTitle", "TotalPay"]]

                          JobTitle  TotalPay
148649  counselor, log cabin ranch   -618.13

In [21]:
df["JobTitle"].describe()

count               312882
unique                1755
top       transit operator
freq                 20383
Name: JobTitle, dtype: object

#### 5. Top Earners:
Who are the top 10 earners in the dataset?
Which JobTitle has the highest number of top earners?

In [34]:
top_10_earners = df.nlargest(10, 'TotalPay')
print(top_10_earners)

                EmployeeName                                        JobTitle  \
270573         paulo morgado                                police officer 3
0             nathaniel ford  general manager-metropolitan transit authority
270574  william j coaker jr.                        chief investment officer
229007  william j coaker jr.                        chief investment officer
1               gary jimenez                 captain iii (police department)
188037  william j coaker jr.                        chief investment officer
148650  william j coaker jr.                        chief investment officer
229010          ronald terry                            sheriff's lieutenant
110531           david shinn                                  deputy chief 3
270575        david e francl                               managing director

          BasePay  OvertimePay   OtherPay   Benefits   TotalPay  \
270573  592394.34         0.00       0.00  120408.02  592394.34
0       167411.18         0.00  400184.25       0.00  567595.43
270574  560793.00         0.00       0.00  119876.54  560793.00
229007  545294.86         0.00       0.00  120885.28  545294.86
1       155966.02    245131.88  137811.38       0.00  538909.28
188037  527343.14         0.00       0.00  114502.68  527343.14
148650  507831.60         0.00       0.00  125891.73  507831.60
229010  176590.01    273076.56   32145.23   64428.26  481811.80
110531  129150.01         0.00  342802.63   38780.04  471952.64
270575  468997.01         0.00       0.00   94470.27  468997.01

        TotalPayBenefits  Year
270573         712802.36  2018
0              567595.43  2011
270574         680669.54  2018
229007         666180.14  2017
1              538909.28  2011
188037         641845.82  2016
148650         633723.33  2015
229010         546240.06  2017
110531         510732.68  2014
270575         563467.28  2018

In [25]:
highest_JobTitle = df["TotalPay"] == df["TotalPay"].max()
df[highest_JobTitle][["JobTitle", "TotalPay"]]

                JobTitle   TotalPay
270573  police officer 3  592394.34

#### 6. Overtime Analysis:
What is the proportion of employees who receive overtime pay?
How does overtime pay affect the overall salary distribution?

In [26]:
df.groupby(["EmployeeName"]).count()["OvertimePay"]

EmployeeName
a bernard  fatooh        1
a bernard fatooh         7
a elizabeth marchasin    1
a jamil niazi            1
a k finizio              5
                        ..
zuri  jones              1
zuri jones               7
zuri s chavarin cerda    1
zuzanna e czerw          2
zykeill j council        1
Name: OvertimePay, Length: 99865, dtype: int64

In [27]:
df['OvertimePay'].describe()

count    312882.000000
mean       5668.911274
std       12745.638970
min        -292.800000
25%           0.000000
50%           0.000000
75%        5223.115000
max      309481.030000
Name: OvertimePay, dtype: float64

#### 7. Benefits Analysis:
What are the most common benefits offered to employees?
Is there a correlation between benefits and salaries?

In [29]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()][['EmployeeName', 'TotalPayBenefits']]

         EmployeeName  TotalPayBenefits
270573  paulo morgado         712802.36

In [36]:
df['Benefits'].max()

125891.73

In [39]:
df[['TotalPay', 'Benefits']].corr()

          TotalPay  Benefits
TotalPay  1.000000  0.761994
Benefits  0.761994  1.000000

#### there are no correlation between benefits  and salaries

#### 8. Top Paid Job Titles:
What are the top 10 job titles with the highest average salaries?
How has the ranking of these job titles changed over time?

In [47]:
df.groupby(["JobTitle"])["TotalPayBenefits"].mean()

JobTitle
account clerk                                     61290.299253
accountant                                        47429.268000
accountant i                                      72607.565333
accountant ii                                     95791.913126
accountant ii (ocii)                              95855.966667
                                                      ...
worker's compensation supervisor i                91020.726000
x-ray laboratory aide                             64646.436124
youth comm advisor                                69760.714444
youth commission advisor, board of supervisors    53632.870000
zoo curator                                       66686.560000
Name: TotalPayBenefits, Length: 1755, dtype: float64

here, i don't know how to get top 10 and ranking

#### 9. Employee Distribution:
How many employees work in each department?
What is the percentage distribution of employees across different JobTitle?

In [49]:
df.groupby(["JobTitle"])["EmployeeName"].count()

JobTitle
account clerk                                     629
accountant                                          5
accountant i                                       15
accountant ii                                     435
accountant ii (ocii)                                3
                                                 ...
worker's compensation supervisor i                  5
x-ray laboratory aide                             129
youth comm advisor                                  9
youth commission advisor, board of supervisors      1
zoo curator                                         1
Name: EmployeeName, Length: 1755, dtype: int64

In [50]:
df.groupby(["JobTitle"])["EmployeeName"].describe()

,count,unique,top,freq
JobTitle,,,,
account clerk,629,275,sue tan,7
accountant,5,5,carlito nepacena,1
accountant i,15,8,carlito a nepacena,4
accountant ii,435,222,emily s chesley,7
accountant ii (ocii),3,1,amit talwar,3
...,...,...,...,...
worker's compensation supervisor i,5,5,linda bernstein,1
x-ray laboratory aide,129,72,kin shing lui,5
youth comm advisor,9,7,adele a carpenter,2
"youth commission advisor, board of supervisors",1,1,mario yedidia,1
zoo curator,1,1,myron sulak,1

#### 10 - Cost of Living:
Is there any correlation between the cost of living in San Francisco and employee salaries?

--> I don't know how to answer this

#### 11. Employee Tenure:
How does the salary vary based on employee tenure in the organization?
Do long-term employees receive higher salaries?

--> I don't know how to answer this

#### 12. Performance and Salary:
Is there any correlation between years and employee salaries?

In [52]:
df[['Year', 'TotalPay']].corr()

              Year  TotalPay
Year      1.000000  0.087536
TotalPay  0.087536  1.000000

#### there are no correlation between years  and salaries

In [53]:
df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011
1,gary jimenez,captain iii (police department),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011
2,albert pardini,captain iii (police department),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011
3,christopher chong,wire rope cable maintenance mechanic,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011
4,patrick gardner,"deputy chief of department,(fire department)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
312877,daniel w plautz,public service trainee,0.00,0.00,0.00,0.0,0.00,0.00,2018
312878,david j thompson,deputy sheriff,0.00,0.00,0.00,0.0,0.00,0.00,2018
312879,keiko weng yee lau,public service trainee,0.00,0.00,0.00,0.0,0.00,0.00,2018
312880,david wong,deputy sheriff,0.00,0.00,0.00,0.0,0.00,0.00,2018
312881,debora e howard,recreation leader,0.00,0.00,0.00,0.0,0.00,0.00,2018